/*
Задание 2.
Написать метод, который проверяет валидность логина и пароля (где нибудь в переменных сохраните) и 
при помощи конструкции try-catch рекурсивно принимайте данные 
(нужно ограничить колиичество попыток до 6 и после 3 попытки должно быть сообщение, 
мол вы привысили количество попыток, немного пододождите 
тут можете поток заслипить на некоторое время. 
А когда попытки кончатся - выйти)
*/

package Seminar3;

public class homework02 {
    public static void main(String[] args) {
        String login = "GeekBrains";
        String password = "123";

    }
}
